Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12084.svd
<?xml version="1.0" encoding="UTF-8"?>
<!--
Copyright (c) 2023 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
         schemaVersion="1.3"
         xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
   <vendor>Microchip Technology</vendor>
   <vendorID>MCHP</vendorID>
   <name>PIC32CX0525SG12084</name>
   <series>0525SG12</series>
   <version>0</version>
   <description>Microchip PIC32CX0525SG12084 Microcontroller</description>
   <cpu>
      <name>CM4</name>
      <revision>r1p0</revision>
      <endian>little</endian>
      <mpuPresent>false</mpuPresent>
      <fpuPresent>false</fpuPresent>
      <nvicPrioBits>3</nvicPrioBits>
      <vendorSystickConfig>false</vendorSystickConfig>
      <deviceNumInterrupts>172</deviceNumInterrupts>
   </cpu>
   <addressUnitBits>8</addressUnitBits>
   <width>32</width>
   <size>32</size>
   <access>read-write</access>
   <resetValue>0x00000000</resetValue>
   <resetMask>0xFFFFFFFF</resetMask>
   <peripherals>
      <peripheral>
         <name>PCR</name>
         <version>1001.0</version>
         <description>The Power, Clocks, and Resets (PCR) Section identifies clock sources, and reset inputs to the chip</description>
         <baseAddress>0x40080100</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x88</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SYS_SLP_CTRL</name>
               <description>System Sleep Control</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLP_MOD</name>
                     <description>Selects the System Sleep mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST</name>
                     <description>Test bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLP_ALL</name>
                     <description>Initiates the System Sleep mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PROC_CLK_CTRL</name>
               <description>Processor Clock Control Register [7:0] Processor Clock Divide Value (PROC_DIV)</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000004</resetValue>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>Selects the EC clock rate</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>DIVSelect</name>
                        <enumeratedValue>
                           <name>DIVIDE_BY_1</name>
                           <description>1: divide 48 MHz Ring Oscillator by 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIVIDE_BY_3</name>
                           <description>3: divide 48 MHz Ring Oscillator by 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIVIDE_BY_4</name>
                           <description>4: divide 48 MHz Ring Oscillator by 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIVIDE_BY_16</name>
                           <description>16: divide 48 MHz Ring Oscillator by 16</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIVIDE_BY_48</name>
                           <description>48: divide 48 MHz Ring Oscillator by 48</description>
                           <value>0x30</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLOW_CLK_CTRL</name>
               <description>Configures the EC_CLK clock domain</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x000001E0</resetValue>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>SLOW_CLOCK_DIVIDE. n=Divide by n; 0=Clock off</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSC_ID</name>
               <description>Oscillator ID Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TEST</name>
                     <description>Test bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PLL_LOCK</name>
                     <description>PLL Lock Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWR_RST_STS</name>
               <description>PCR Power Reset Status Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000050</resetValue>
               <fields>
                  <field>
                     <name>VCC_PWRGD_STS</name>
                     <description>Indicates the status of VCC_PWRGD. 0 = PWRGD not asserted. 1 = PWRGD asserte.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_H_STS</name>
                     <description>Indicates the status of RESET_VCC. 0 = reset active. 1 = reset not active.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_VTR_STS</name>
                     <description>Indicates the status of RESET_VTR. 0 = reset active. 1 = reset not active.(R/W1C)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBAT_RST_STS</name>
                     <description>VBAT reset status 0 = No reset occurred while VTR was off or since the last time this bit was cleared. 1 = A reset occurred.(R/WC)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_SYS_STS</name>
                     <description>Indicates the status of RESET_SYS.(R/W1C)\n                0 = No reset occurred since the last time this bit was cleared.\n                1 = A reset occurred.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JTAG_RST_STS</name>
                     <description>Indicates status of JTAG_TRST# pin.\n                0 = No JTAG reset occurred since the last time this bit was cleared.\n                1 = A reset occurred because of a JTAG command.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT_EVENT</name>
                     <description>Indicates that a WDT_EVENT happened. (R/W1C)\n                0 = Not active.\n                1 = A WDT_EVENT occured.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACTIVE_32K</name>
                     <description>ACTIVE_32K (32K_ACTIVE)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCICLK_ACTIVE</name>
                     <description>PCICLK_ACTIVE (PCICLK_ACTIVE)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWR_RST_CTRL</name>
               <description>Power Reset Control Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000101</resetValue>
               <fields>
                  <field>
                     <name>PWR_INV</name>
                     <description>Used by FW to control internal RESET_VCC signal function and external PWROK pin. This bit is read-only when VCC_PWRGD\n      is de-asserted low.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>H_RST_SEL</name>
                     <description>Determines what generates the internal platform reset signal. 1=LRESET# pin; 0=eSPI PLTRST# VWire</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYS_RST</name>
               <description>System Reset Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SOFT_SYS_RST</name>
                     <description>A write of a 1 forces an assertion of the RESET_SYS reset signal, resetting the device. A write of 0 has no effect.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLP_EN_0</name>
               <description>Sleep Enable 0 Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OTP_SLP_EN</name>
                     <description>OTP Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLP_EN_1</name>
               <description>Sleep Enable 1 Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INT_SLP_EN</name>
                     <description>Interrupt Sleep Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TACH0_SLP_EN</name>
                     <description>TACH0 Sleep Enable (TACH0_SLP_EN)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM0_SLP_EN</name>
                     <description>PWM0 Sleep Enable (PWM0_SLP_EN)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PMC_SLP_EN</name>
                     <description>PMC Sleep Enable (PMC_SLP_EN)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_SLP_EN</name>
                     <description>DMA Sleep Enable (DMA_SLP_EN)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFDP_SLP_EN</name>
                     <description>TFDP Sleep Enable (TFDP_SLP_EN)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROC_SLP_EN</name>
                     <description>PROCESSOR Sleep Enable (PROCESSOR_SLP_EN)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB0_SLP_EN</name>
                     <description>SMB0 Sleep Enable (SMB0_SLP_EN)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TACH2_SLP_EN</name>
                     <description>TACH2 Sleep Enable (TACH2_SLP_EN)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM1_SLP_EN</name>
                     <description>PWM1 Sleep Enable (PWM1_SLP_EN)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM4_SLP_EN</name>
                     <description>PWM4 Sleep Enable (PWM4_SLP_EN)</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM6_SLP_EN</name>
                     <description>PWM6 Sleep Enable (PWM6_SLP_EN)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM7_SLP_EN</name>
                     <description>PWM7 Sleep Enable (PWM7_SLP_EN)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EC_REG_BANK_SLP_EN</name>
                     <description>EC_REG_BANK Sleep Enable (EC_REG_BANK_SLP_EN)</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR16_0_SLP_EN</name>
                     <description>TIMER16_0 Sleep Enable (TIMER16_0_SLP_EN)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR16_1_SLP_EN</name>
                     <description>TIMER16_1 Sleep Enable (TIMER16_1_SLP_EN)</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLP_EN_2</name>
               <description>Sleep Enable 2 Register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>UART0_SLP_EN</name>
                     <description>UART 0 Sleep Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UART1_SLP_EN</name>
                     <description>UART 1 Sleep Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UART2_SLP_EN</name>
                     <description>UART 2 Sleep Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLP_EN_3</name>
               <description>Sleep Enable 3 Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HDMI_CEC_SLP_EN</name>
                     <description>HDMI_CEC Sleep Enable (ADC_SLP_EN)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADC_SLP_EN</name>
                     <description>ADC Sleep Enable (ADC_SLP_EN)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PS2_0_SLP_EN</name>
                     <description>PS2_0 Sleep Enable (PS2_0_SLP_EN)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTM_0_SLP_EN</name>
                     <description>Hibernation Timer 0 Sleep Enable (HTM_0_SLP_EN)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB1_SLP_EN</name>
                     <description>SMB1 Sleep Enable (SMB1_SLP_EN)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB2_SLP_EN</name>
                     <description>SMB2 Sleep Enable (SMB2_SLP_EN)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB3_SLP_EN</name>
                     <description>SMB3 Sleep Enable (SMB3_SLP_EN)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LED0_SLP_EN</name>
                     <description>LED0 Sleep Enable (LED0_SLP_EN)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB4_SLP_EN</name>
                     <description>SMB4 Sleep Enable (SMB4_SLP_EN)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR32_0_SLP_EN</name>
                     <description>TIMER32_0 Sleep Enable (TIMER32_0_SLP_EN)</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR32_1_SLP_EN</name>
                     <description>TIMER32_1 Sleep Enable (TIMER32_1_SLP_EN)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PKE_SLP_EN</name>
                     <description>PKE Sleep Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RNG_SLP_EN</name>
                     <description>RNG Sleep Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AES_HASH_SLP_EN</name>
                     <description>AES_HASH Sleep Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTM_1_SLP_EN</name>
                     <description>Hibernation TIMER 1 Sleep Enable (HTM_1_SLP_EN)</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCT_SLP_EN</name>
                     <description>Capture Compare Timer Sleep Enable (CCTIMER_SLP_EN)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
