Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12084.svd
            <register>
               <name>SLP_EN_4</name>
               <description>Sleep Enable 4 Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMSPI_SLP_EN</name>
                     <description>Quad Master SPI Sleep Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C5_SLP_EN</name>
                     <description>I2C5 Sleep Enable (I2C5_SLP_EN)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C6_SLP_EN</name>
                     <description>I2C6 Sleep Enable (I2C6_SLP_EN)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C7_SLP_EN</name>
                     <description>I2C7 Sleep Enable (I2C7_SLP_EN)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SGPIO0_SLP_EN</name>
                     <description>SGPIO0 Sleep Enable (SGPIO0_SLP_EN)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SGPIO1_SLP_EN</name>
                     <description>SGPIO1 Sleep Enable (SGPIO1_SLP_EN)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLK_REQ_0</name>
               <description>Clock Required 0 Register</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JTAG_STAP_CLK_REQ</name>
                     <description>JTAG STAP Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTP_CLK_REQ</name>
                     <description>OTP Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLK_REQ_1</name>
               <description>Clock Required 1 Register</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INT_CLK_REQ</name>
                     <description>Interrupt Clock Required</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TACH0_CLK_REQ</name>
                     <description>TACH0 Clock Required (TACH0_CLK_REQ)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM0_CLK_REQ</name>
                     <description>PWM0 Clock Required (PWM0_CLK_REQ)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PMC_CLK_REQ</name>
                     <description>PMC Clock Required (PMC_CLK_REQ)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_CLK_REQ</name>
                     <description>DMA Clock Required (DMA_CLK_REQ)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFDP_CLK_REQ</name>
                     <description>TFDP Clock Required (TFDP_CLK_REQ)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROC_CLK_REQ</name>
                     <description>PROCESSOR Clock Required (PROCESSOR_CLK_REQ)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT_CLK_REQ</name>
                     <description>WDT Clock Required (WDT_CLK_REQ)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB0_CLK_REQ</name>
                     <description>SMB0 Clock Required (SMB0_CLK_REQ)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TACH2_CLK_REQ</name>
                     <description>TACH2 Clock Required (TACH2_CLK_REQ)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM1_CLK_REQ</name>
                     <description>PWM1 Clock Required (PWM1_CLK_REQ)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM4_CLK_REQ</name>
                     <description>PWM4 Clock Required (PWM4_CLK_REQ)</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM6_CLK_REQ</name>
                     <description>PWM6 Clock Required (PWM6_CLK_REQ)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM7_CLK_REQ</name>
                     <description>PWM7 Clock Required (PWM7_CLK_REQ)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EC_REG_BANK_CLK_REQ</name>
                     <description>EC_REG_BANK Clock Required (EC_REG_BANK_CLK_REQ)</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR16_0_CLK_REQ</name>
                     <description>TIMER16_0 Clock Required (TIMER16_0_CLK_REQ)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR16_1_CLK_REQ</name>
                     <description>TIMER16_1 Clock Required (TIMER16_1_CLK_REQ)</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLK_REQ_2</name>
               <description>Clock Required 2 Register</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IMAP_CLK_REQ</name>
                     <description>IMAP Clock Required (IMAP_CLK_REQ)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UART0_CLK_REQ</name>
                     <description>UART 0 Clock Required</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UART1_CLK_REQ</name>
                     <description>UART 1 Clock Required</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GLBL_CFG_CLK_REQ</name>
                     <description>GLBL_CFG (GLBL_CFG_CLK_REQ)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KBCEM_CLK_REQ</name>
                     <description>8042EM Clock Required (8042EM_CLK_REQ)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC_CLK_REQ</name>
                     <description>RTC Clock Required (RTC_CLK_REQ)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UART2_CLK_REQ</name>
                     <description>UART 2 Clock Required</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLK_REQ_3</name>
               <description>Clock Required 3 Register</description>
               <addressOffset>0x5C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HDMI_CEC_CLK_REQ</name>
                     <description>HDMI_CEC Clock Required (ADC_CLK_REQ)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADC_CLK_REQ</name>
                     <description>ADC Clock Required (ADC_CLK_REQ)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PS2_0_CLK_REQ</name>
                     <description>PS2_0 Clock Required (PS2_0_CLK_REQ)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTM0_CLK_REQ</name>
                     <description>Hibernation TIMER 0 Clock Required (HTM_0_CLK_REQ)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB1_CLK_REQ</name>
                     <description>SMB1 Clock Required (SMB1_CLK_REQ)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB2_CLK_REQ</name>
                     <description>SMB2 Clock Required (SMB2_CLK_REQ)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB3_CLK_REQ</name>
                     <description>SMB3 Clock Required (SMB3_CLK_REQ)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LED0_CLK_REQ</name>
                     <description>LED0 Clock Required (LED0_CLK_REQ)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB_4_CLK_REQ</name>
                     <description>SMB 4 Clock Required (SMB_4_CLK_REQ)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR32_0_CLK_REQ</name>
                     <description>TIMER32_0 Clock Required (TIMER32_0_CLK_REQ)</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR32_1_CLK_REQ</name>
                     <description>TIMER32_1 Clock Required (TIMER32_1_CLK_REQ)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PKE_CLK_REQ</name>
                     <description>PKE Clock Required</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RNG_CLK_REQ</name>
                     <description>RNG Clock Required</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AES_HASH_CLK_REQ</name>
                     <description>AES_HASH Clock Required</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTM_1_CLK_REQ</name>
                     <description>Hibernation TIMER 1 Clock Required (HTM_1_CLK_REQ)</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCTIMER_CLK_REQ</name>
                     <description>Capture Compare Timer Clock Required (CCTIMER_CLK_REQ)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLK_REQ_4</name>
               <description>Clock Required 4 Register</description>
               <addressOffset>0x60</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RTOS_CLK_REQ</name>
                     <description>RTOS Clock Required (RTOS_CLK_REQ)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QMSPI_CLK_REQ</name>
                     <description>Quad Master SPI Clock Required</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C5_CLK_REQ</name>
                     <description>I2C5 Clock Required (I2C5_CLK_REQ)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C6_CLK_REQ</name>
                     <description>I2C6 Clock Required (I2C6_CLK_REQ)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C7_CLK_REQ</name>
                     <description>I2C7 Clock Required (I2C7_CLK_REQ)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI_SLAVE_CLK_REQ</name>
                     <description>SPI SLAVE Clock Required (SPI_SLAVE_CLK_REQ)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SGPIO0_CLK_REQ</name>
                     <description>SGPIO0 Clock Required (SGPIO0_CLK_REQ)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SGPIO1_CLK_REQ</name>
                     <description>SGPIO1 Clock Required (SGPIO1_CLK_REQ)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RST_EN_0</name>
               <description>Reset Enable 0 Register</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OTP_RST_EN</name>
                     <description>OTP Reset Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RST_EN_1</name>
               <description>Reset Enable 1 Register</description>
               <addressOffset>0x74</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INT_RST_EN</name>
                     <description>Interrupt Reset Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TACH0_RST_EN</name>
                     <description>TACH0 Reset Enable (TACH0_RST_EN)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM0_RST_EN</name>
                     <description>PWM0 Reset Enable (PWM0_RST_EN)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_RST_EN</name>
                     <description>DMA Reset Enable (DMA_RST_EN)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFDP_RST_EN</name>
                     <description>TFDP Reset Enable (TFDP_RST_EN)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT_RST_EN</name>
                     <description>WDT Reset Enable (WDT_RST_EN)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB0_RST_EN</name>
                     <description>SMB0 Reset Enable (SMB0_RST_EN)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TACH2_RST_EN</name>
                     <description>TACH2 Reset Enable (TACH2_RST_EN)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM1_RST_EN</name>
                     <description>PWM1 Reset Enable (PWM1_RST_EN)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM4_RST_EN</name>
                     <description>PWM4 Reset Enable (PWM4_RST_EN)</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM6_RST_EN</name>
                     <description>PWM6 Reset Enable (PWM6_RST_EN)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM7_RST_EN</name>
                     <description>PWM7 Reset Enable (PWM7_RST_EN)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR16_0_RST_EN</name>
                     <description>TIMER16_0 Reset Enable (TIMER16_0_RST_EN)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR16_1_RST_EN</name>
                     <description>TIMER16_1 Reset Enable (TIMER16_1_RST_EN)</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
