Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12084.svd
            <register>
               <name>SRC26</name>
               <description>GIRQ26 Source Register</description>
               <addressOffset>0x168</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET26</name>
               <description>GIRQ26 Enable Set Register</description>
               <addressOffset>0x16c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT26</name>
               <description>GIRQ26 Result Register</description>
               <addressOffset>0x170</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR26</name>
               <description>GIRQ26 Enable Clear Register</description>
               <addressOffset>0x174</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>BLK_EN_SET</name>
               <description>Block Enable Set Register</description>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VTOR_EN_SET</name>
                     <description>Each GIRQx bit can be individually enabled to assert an interrupt event.\n      Reads always return the current value of the internal GIRQX_ENABLE bit. The state of the GIRQX_ENABLE bit is determined by\n      the corresponding GIRQX_ENABLE_SET bit and the GIRQX_ENABLE_CLEAR bit. (0=disabled, 1=enabled) (R/WS)\n      1=Interrupts in the GIRQx Source Register may be enabled\n      0=No effect.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BLK_EN_CLR</name>
               <description>Block Enable Clear Register.</description>
               <addressOffset>0x204</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VTOR_EN_CLR</name>
                     <description>Each GIRQx bit can be individually disabled to inhibit an interrupt event.\n      Reads always return the current value of the internal GIRQX_ENABLE bit. The state of the GIRQX_ENABLE bit is determined by\n      the corresponding GIRQX_ENABLE_SET bit and the GIRQX_ENABLE_CLEAR bit. (0=disabled, 1=enabled) (R/WC)\n      1=All interrupts in the GIRQx Source Register are disabled\n      0=No effect.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BLK_IRQ_VTOR</name>
               <description>Block IRQ Vector Register</description>
               <addressOffset>0x208</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VTOR</name>
                     <description>Each bit in this field reports the status of the group GIRQ interrupt assertion to the NVIC. If the GIRQx interrupt\n      is disabled as a group, by the Block Enable Clear Register, then the corresponding bit will be '0'b and no interrupt will be asserted.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>25</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>GCR</name>
         <version>1011.0</version>
         <description>The Logical Device Configuration registers support motherboard designs in\n        which the resources required by their components are known and assigned by the BIOS\n        at POST.</description>
         <baseAddress>0x400FFF00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x22</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>LDN</name>
               <description>A write to this register selects the current logical device. This allows access to the control and configuration\n     registers for each logical device. Note: The Activate command operates only on the selected logical device.</description>
               <addressOffset>0x7</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>DEV_REV</name>
               <description>A read-only register which provides device revision information.</description>
               <addressOffset>0x1C</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>DEV_SUBID</name>
               <description>A read-only register which provides device sub ID information.</description>
               <addressOffset>0x1D</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x22</resetValue>
            </register>
            <register>
               <name>DEV_ID</name>
               <description>A read-only register which provides device identification.</description>
               <addressOffset>0x1E</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0x0020</resetValue>
            </register>
            <register>
               <name>LEG_DEV_ID</name>
               <description>A read-only register which provides legacy device identification.</description>
               <addressOffset>0x20</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0xFE</resetValue>
            </register>
            <register>
               <name>LEG_DEV_REV</name>
               <description>A read-only register which provides legacy device revision information.</description>
               <addressOffset>0x21</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0xA0</resetValue>
            </register>
