Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12084.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PORT92</name>
         <version>441.0</version>
         <description>The registers listed in the Configuration Register Summary table are for a single instance of the Legacy Port92/GATEA20 logic.</description>
         <baseAddress>0x400F2000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x331</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>RT_PORT92</name>
               <description>PORT92 Register: The registers listed in the Runtime Register Summary table are for a single instance of the Legacy Port92/GATEA20 logic.</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ALT_CPU_RST</name>
                     <description>This bit provides an alternate means to generate a CPU_RESET pulse.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALT_GATE_A20</name>
                     <description>This bit provides an alternate means for system control of the GATEA20 pin. ALT_A20 low drives GATEA20 low, if A20 from the\n      keyboard controller is also low. When Port 92 is enabled, writing a 1 to this bit forces ALT_A20 high. ALT_A20 high drives GATEA20\n      high regardless of the state of A20 from the keyboard controller. 0=ALT_A20 is driven low; 1=ALT_A20 is driven high</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GATEA20</name>
               <description>GATEA20 Control Register</description>
               <addressOffset>0x100</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>GATEA20</name>
                     <description>0=The GATEA20 output is driven low, 1=The GATEA20 output is driven high.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SETGA20L</name>
               <description>SETGA20L Register. A write to this register sets GATEA20 in the GATEA20 Control Register.</description>
               <addressOffset>0x108</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>RSTGA20L</name>
               <description>RSTGA20L Register. A write to this register sets GATEA20 in the GATEA20 Control Register.</description>
               <addressOffset>0x10C</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>EN</name>
               <description>PORT92 Enable Register</description>
               <addressOffset>0x330</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>When this bit is '1', the Port92h Register is enabled. When this bit is '0', the Port92h Register is disabled, and Host\n      writes to Host address 92h are ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>ACPI_EC0</name>
         <version>11.0</version>
         <description>The ACPI-ECI provides a four byte full duplex data interface.</description>
         <groupName>ACPI_EC</groupName>
         <prependToName>ACPI_EC_</prependToName>
         <baseAddress>0x400F0800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x10C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>AEC0_IBF</name>
            <value>45</value>
         </interrupt>
         <interrupt>
            <name>AEC0_OBE</name>
            <value>46</value>
         </interrupt>
         <registers>
            <register>
               <name>OS_DATA</name>
               <description>This is byte n of the 32-bit ACPI-OS DATA BYTES[3:0]. Writes by the ACPI_OS to the ACPI-OS DATA BYTES[n] are aliased\n    to the OS2EC DATA BYTES[n]. Reads by the ACPI_OS from the ACPI-OS DATA BYTES[n] are aliased to the EC2OS DATA BYTES[n].</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>OS_CMD</name>
               <description>Writes to the this register are aliased in the OS2EC Data EC Byte 0 Register.\n              Writes to this register also set the CMD and IBF bits in the OS STATUS OS Register</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>OS_STS</name>
               <description>OS STATUS</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>OBF</name>
                     <description>The Output Buffer Full bit is set to indicate that a the ACPI_EC has written a data to the ACPI_OS and that data is ready.\n     This bit is automatically cleared when all the data has been read by the ACPI_OS.     Note: The setting and clearing of this OBF varies depending on the setting FOUR_BYTE_ACCESS bit in the OS Byte Control Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IBF</name>
                     <description>The Input Buffer Full bit is set to indicate that a the ACPI_OS has written a command or data to the ACPI_EC and that\n     data is ready. This bit is automatically cleared when data has been read by the ACPI_EC.\n     Note: The setting and clearing of this IBF varies depending on the setting of the following bits: CMD bit in this register\n     and FOUR_BYTE_ACCESS bit in the OS Byte Control Register.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UD1B</name>
                     <description>User Defined</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMD</name>
                     <description>This bit is set when the OS2EC Data EC Byte 0 Register contains a command byte written into ACPI OS COMMAND Register;\n     this bit is cleared when the OS2EC DATA BYTES[3:0] contains a data byte written into the ACPI-OS DATA BYTES[3:0].\n     This bit is hardware controlled:\n     ACPI_OS writes to any of the four ACPI-OS DATA BYTES[3:0] bytes clears this bit\n     ACPI_OS writes to the ACPI OS COMMAND Register sets this bit.\n     Note: This bit allows the embedded controller to differentiate the start of a command sequence from a data byte write operation.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BURST</name>
                     <description>The BURST bit is set when the ACPI_EC is in Burst Mode for polled command processing; the BURST bit is cleared when the\n     ACPI_EC is in Normal mode for interrupt-driven command processing. The BURST bit is is an ACPI_EC-maintained software flag that\n     indicates the embedded controller has received the Burst Enable command from the host, has halted normal processing, and is\n     waiting for a series of commands to be sent from the host.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCI_EVT</name>
                     <description>This bit is set by software when an SCI event is pending; i.e., the ACPI_EC is requesting an SCI query; SCI Event flag\n     is clear when no SCI events are pending. This bit is an ACPI_EC-maintained software flag that is set when the embedded controller\n     has detected an internal event that requires operating system attention. The ACPI_EC sets this bit before generating an SCI to the OS.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMI_EVT</name>
                     <description>This bit is set when an SMI event is pending; i.e., the ACPI_EC is requesting an SMI query; This bit is cleared when\n     no SMI events are pending. This bit is an ACPI_EC-maintained software flag that is set when the ACPI_EC has detected an internal\n     event that requires system management interrupt handler attention. The ACPI_EC sets this bit before generating an SMI.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UD0B</name>
                     <description>User Defined</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OS_BYTE_CTRL</name>
               <description>OS Byte Control Register</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>FOUR_BYTE_ACCESS</name>
                     <description>When this bit is set to '1', the ACPI Embedded Controller Interface (ACPI-ECI) accesses four bytes through the\n     ACPI-OS DATA BYTES[3:0]. When this bit is cleared to '0', the ACPI Embedded Controller Interface (ACPI-ECI) accesses one byte\n     through the ACPI OS Data Register Byte 0 Register. This corresponds to Legacy Mode. This bit effects the behaviour of the IBF\n     and OBF bits in the OS STATUS OS Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EC2OS_DATA</name>
               <description>This is byte n of the 32-bit EC2OS DATA BYTES[3:0]. Writes by the ACPI_EC to the EC2OS DATA BYTES[3:0] are aliased to the\n    ACPI-OS DATA BYTES[3:0].</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>EC_STATUS</name>
               <description>EC STATUS</description>
               <addressOffset>0x104</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>OBF</name>
                     <description>The Output Buffer Full bit is set to indicate that a the ACPI_EC has written a data to the ACPI_OS and that data is ready.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IBF</name>
                     <description>The Input Buffer Full bit is set to indicate that a the ACPI_OS has written a command or data to the ACPI_EC and that data is ready.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UD1A</name>
                     <description>UD1A User Defined</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMD</name>
                     <description>This bit is set when the OS2EC Data EC Byte 0 Register contains a command byte written into ACPI OS COMMAND Register</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BURST</name>
                     <description>The BURST bit is set when the ACPI_EC is in Burst Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCI_EVT</name>
                     <description>This bit is set by software when an SCI event is pending</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMI_EVT</name>
                     <description>This bit is set when an SMI event is pending</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UD0A</name>
                     <description>User Defined</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EC_BYTE_CTRL</name>
               <description>Byte Control EC-Register</description>
               <addressOffset>0x105</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>FOUR_BYTE_ACCESS</name>
                     <description>When this bit is set to '1', the ACPI Embedded Controller Interface (ACPI-ECI) accesses four bytes through the\n     ACPI-OS DATA BYTES[3:0]. When this bit is cleared to '0', the ACPI Embedded Controller Interface (ACPI-ECI) accesses one byte\n     through the ACPI OS Data Register Byte 0 Register. This corresponds to Legacy Mode. This bit effects the behaviour of the IBF\n     and OBF bits in the OS STATUS OS Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OS2EC_DATA</name>
               <description>OS_TO_EC_DATA_BYTE_n. This is byte n of the 32-bit OS2EC DATA BYTES[3:0]. When the CMD bit in the OS STATUS OS Register\n    is cleared to '0', reads by the ACPI_EC from the OS2EC DATA BYTES[3:0] are aliased to the ACPI-OS DATA BYTES[3:0].</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <resetValue>0x00</resetValue>
            </register>
