Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12084.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="ACPI_EC0">
         <name>ACPI_EC1</name>
         <baseAddress>0x400F0C00</baseAddress>
         <interrupt>
            <name>AEC1_IBF</name>
            <value>47</value>
         </interrupt>
         <interrupt>
            <name>AEC1_OBE</name>
            <value>48</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="ACPI_EC0">
         <name>ACPI_EC2</name>
         <baseAddress>0x400F1000</baseAddress>
         <interrupt>
            <name>AEC2_IBF</name>
            <value>49</value>
         </interrupt>
         <interrupt>
            <name>AEC2_OBE</name>
            <value>50</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="ACPI_EC0">
         <name>ACPI_EC3</name>
         <baseAddress>0x400F1400</baseAddress>
         <interrupt>
            <name>AEC3_IBF</name>
            <value>51</value>
         </interrupt>
         <interrupt>
            <name>AEC3_OBE</name>
            <value>52</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>PM1</name>
         <version>21.0</version>
         <description>These features comply with the ACPI Specification through a combination of hardware and EC software</description>
         <baseAddress>0x400F1C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x111</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>APM1_CTL</name>
            <value>55</value>
         </interrupt>
         <interrupt>
            <name>APM1_EN</name>
            <value>56</value>
         </interrupt>
         <interrupt>
            <name>APM1_STS</name>
            <value>57</value>
         </interrupt>
         <registers>
            <register>
               <name>H_PM1_STS2</name>
               <description>PM1 Status 2</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>PWRBTN_STS</name>
                     <description>This bit can be set or cleared by the EC to simulate a Power button status if the power is controlled by the EC.\n      The Host writing a one to this bit can also clear this bit. The EC must generate the associated SCI interrupt under software control. (R/WC)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLPBTN_STS</name>
                     <description>This bit can be set or cleared by the EC to simulate a Sleep button status if the sleep state is controlled by\n      the EC. The Host writing a one to this bit can also clear this bit. The EC must generate the associated SCI interrupt under software\n      control.(R/WC)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC_STS</name>
                     <description>This bit can be set or cleared by the EC to simulate a RTC status. The Host writing a one to this bit can also\n      clear this bit. The EC must generate the associated SCI interrupt under software control. (R/WC)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWRBTNOR_STS</name>
                     <description>This bit can be set or cleared by the EC to simulate a Power button override event status if the power\n      is controlled by the EC. The Host writing a one to this bit can also clear this bit. The EC must generate the associated hardware\n      event under software control.(R/WC)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAK_STS</name>
                     <description>This bit can be set or cleared by the EC. The Host writing a one to this bit can also clear this bit. (R/WC)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>H_PM1_EN2</name>
               <description>PM1 Enable 2</description>
               <addressOffset>0x3</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>PWRBTN_EN</name>
                     <description>This bit can be read or written by the Host. It can be read by the EC.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLPBTN_EN</name>
                     <description>This bit can be read or written by the Host. It can be read by the EC.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC_EN</name>
                     <description>This bit can be read or written by the Host. It can be read by the EC.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>H_PM1_CTRL2</name>
               <description>PM1 Control 2</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>PWRBTNOR_EN</name>
                     <description>This bit can be set or cleared by the Host, read by the EC.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLP_TYP</name>
                     <description>These bits can be set or cleared by the Host, read by the EC.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SLP_EN</name>
                     <description>SLP_EN</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EC_PM1_STS2</name>
               <description>PM1 Status 2</description>
               <addressOffset>0x101</addressOffset>
               <size>8</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWRBTN_STS</name>
                     <description>This bit can be set or cleared by the EC to simulate a Power button status if the power is controlled by the EC.\n      The Host writing a one to this bit can also clear this bit. The EC must generate the associated SCI interrupt under software control. (R/WC)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLPBTN_STS</name>
                     <description>This bit can be set or cleared by the EC to simulate a Sleep button status if the sleep state is controlled by\n      the EC. The Host writing a one to this bit can also clear this bit. The EC must generate the associated SCI interrupt under software\n      control.(R/WC)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC_STS</name>
                     <description>This bit can be set or cleared by the EC to simulate a RTC status. The Host writing a one to this bit can also\n      clear this bit. The EC must generate the associated SCI interrupt under software control. (R/WC)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWRBTNOR_STS</name>
                     <description>This bit can be set or cleared by the EC to simulate a Power button override event status if the power\n      is controlled by the EC. The Host writing a one to this bit can also clear this bit. The EC must generate the associated hardware\n      event under software control.(R/WC)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAK_STS</name>
                     <description>This bit can be set or cleared by the EC. The Host writing a one to this bit can also clear this bit. (R/WC)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EC_PM1_EN2</name>
               <description>PM1 Enable 2</description>
               <addressOffset>0x103</addressOffset>
               <size>8</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWRBTN_EN</name>
                     <description>This bit can be read or written by the Host. It can be read by the EC.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLPBTN_EN</name>
                     <description>This bit can be read or written by the Host. It can be read by the EC.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC_EN</name>
                     <description>This bit can be read or written by the Host. It can be read by the EC.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EC_PM1_CTRL2</name>
               <description>PM1 Control 2</description>
               <addressOffset>0x105</addressOffset>
               <size>8</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWRBTNOR_EN</name>
                     <description>This bit can be set or cleared by the Host, read by the EC.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLP_TYP</name>
                     <description>These bits can be set or cleared by the Host, read by the EC.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SLP_EN</name>
                     <description>SLP_EN</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EC_PM_STS</name>
               <description>PM1 EC PM Status</description>
               <addressOffset>0x110</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>EC_SCI_STS</name>
                     <description>If the EC_SCI_STS bit is '1', an interrupt is generated on the EC_SCI# pin.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UD</name>
                     <description>User Defined</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
