Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12084.svd
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL13[%s]</name>
               <description>GPIO Pin Control Register</description>
               <addressOffset>0x160</addressOffset>
               <size>32</size>
               <resetValue>0x00008040</resetValue>
               <fields>
                  <field>
                     <name>PU_PD</name>
                     <description>These bits are used to enable an internal pull-up or pull-down resistor.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PWR_GATING</name>
                     <description>The GPIO pin will be tristated when the selected power well is off.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>INTR_DET</name>
                     <description>Determines the interrupt capability of the GPIO input.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EDGE_EN</name>
                     <description>Determines the interrupt capability of the GPIO input.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OUT_BUFF_TYPE</name>
                     <description>0 = Push-Pull, 1 = Open Drain</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_DIR</name>
                     <description>Buffer direction when GPIO selected by pin mux 0 = Input, 1 = Output</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_OUT_SEL</name>
                     <description>GPIO outputs registe select.0=GPIO ALTERNATE_GPIO_DATA 1=GPIO Output Register.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>1=Inverted; 0=Non-inverted</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MUX_CTRL</name>
                     <description>00 = GPIO Function, 01 = Function 1, 10 = Function 2, 11 = Function 3.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>INP_DIS</name>
                     <description>GPIO input disable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALT_GPIO_DATA</name>
                     <description>GPIO Alternate Data Register.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_INP</name>
                     <description>GPIO input from pin, independent of the Mux selection for the pin or the Direction.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL14[%s]</name>
               <description>GPIO Pin Control Register</description>
               <addressOffset>0x180</addressOffset>
               <size>32</size>
               <resetValue>0x00008040</resetValue>
               <fields>
                  <field>
                     <name>PU_PD</name>
                     <description>These bits are used to enable an internal pull-up or pull-down resistor.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PWR_GATING</name>
                     <description>The GPIO pin will be tristated when the selected power well is off.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>INTR_DET</name>
                     <description>Determines the interrupt capability of the GPIO input.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EDGE_EN</name>
                     <description>Determines the interrupt capability of the GPIO input.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OUT_BUFF_TYPE</name>
                     <description>0 = Push-Pull, 1 = Open Drain</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_DIR</name>
                     <description>Buffer direction when GPIO selected by pin mux 0 = Input, 1 = Output</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_OUT_SEL</name>
                     <description>GPIO outputs registe select.0=GPIO ALTERNATE_GPIO_DATA 1=GPIO Output Register.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>1=Inverted; 0=Non-inverted</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MUX_CTRL</name>
                     <description>00 = GPIO Function, 01 = Function 1, 10 = Function 2, 11 = Function 3.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>INP_DIS</name>
                     <description>GPIO input disable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALT_GPIO_DATA</name>
                     <description>GPIO Alternate Data Register.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_INP</name>
                     <description>GPIO input from pin, independent of the Mux selection for the pin or the Direction.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL15[%s]</name>
               <description>GPIO Pin Control Register</description>
               <addressOffset>0x1a0</addressOffset>
               <size>32</size>
               <resetValue>0x00008040</resetValue>
               <fields>
                  <field>
                     <name>PU_PD</name>
                     <description>These bits are used to enable an internal pull-up or pull-down resistor.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PWR_GATING</name>
                     <description>The GPIO pin will be tristated when the selected power well is off.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>INTR_DET</name>
                     <description>Determines the interrupt capability of the GPIO input.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EDGE_EN</name>
                     <description>Determines the interrupt capability of the GPIO input.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OUT_BUFF_TYPE</name>
                     <description>0 = Push-Pull, 1 = Open Drain</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_DIR</name>
                     <description>Buffer direction when GPIO selected by pin mux 0 = Input, 1 = Output</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_OUT_SEL</name>
                     <description>GPIO outputs registe select.0=GPIO ALTERNATE_GPIO_DATA 1=GPIO Output Register.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>1=Inverted; 0=Non-inverted</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MUX_CTRL</name>
                     <description>00 = GPIO Function, 01 = Function 1, 10 = Function 2, 11 = Function 3.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>INP_DIS</name>
                     <description>GPIO input disable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALT_GPIO_DATA</name>
                     <description>GPIO Alternate Data Register.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_INP</name>
                     <description>GPIO input from pin, independent of the Mux selection for the pin or the Direction.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL16[%s]</name>
               <description>GPIO Pin Control Register</description>
               <addressOffset>0x1c0</addressOffset>
               <size>32</size>
               <resetValue>0x00008040</resetValue>
               <fields>
                  <field>
                     <name>PU_PD</name>
                     <description>These bits are used to enable an internal pull-up or pull-down resistor.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PWR_GATING</name>
                     <description>The GPIO pin will be tristated when the selected power well is off.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>INTR_DET</name>
                     <description>Determines the interrupt capability of the GPIO input.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EDGE_EN</name>
                     <description>Determines the interrupt capability of the GPIO input.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OUT_BUFF_TYPE</name>
                     <description>0 = Push-Pull, 1 = Open Drain</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_DIR</name>
                     <description>Buffer direction when GPIO selected by pin mux 0 = Input, 1 = Output</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_OUT_SEL</name>
                     <description>GPIO outputs registe select.0=GPIO ALTERNATE_GPIO_DATA 1=GPIO Output Register.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>1=Inverted; 0=Non-inverted</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MUX_CTRL</name>
                     <description>00 = GPIO Function, 01 = Function 1, 10 = Function 2, 11 = Function 3.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>INP_DIS</name>
                     <description>GPIO input disable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALT_GPIO_DATA</name>
                     <description>GPIO Alternate Data Register.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_INP</name>
                     <description>GPIO input from pin, independent of the Mux selection for the pin or the Direction.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL17[%s]</name>
               <description>GPIO Pin Control Register</description>
               <addressOffset>0x1e0</addressOffset>
               <size>32</size>
               <resetValue>0x00008040</resetValue>
               <fields>
                  <field>
                     <name>PU_PD</name>
                     <description>These bits are used to enable an internal pull-up or pull-down resistor.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PWR_GATING</name>
                     <description>The GPIO pin will be tristated when the selected power well is off.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>INTR_DET</name>
                     <description>Determines the interrupt capability of the GPIO input.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EDGE_EN</name>
                     <description>Determines the interrupt capability of the GPIO input.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OUT_BUFF_TYPE</name>
                     <description>0 = Push-Pull, 1 = Open Drain</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_DIR</name>
                     <description>Buffer direction when GPIO selected by pin mux 0 = Input, 1 = Output</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_OUT_SEL</name>
                     <description>GPIO outputs registe select.0=GPIO ALTERNATE_GPIO_DATA 1=GPIO Output Register.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>1=Inverted; 0=Non-inverted</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MUX_CTRL</name>
                     <description>00 = GPIO Function, 01 = Function 1, 10 = Function 2, 11 = Function 3.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>INP_DIS</name>
                     <description>GPIO input disable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALT_GPIO_DATA</name>
                     <description>GPIO Alternate Data Register.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_INP</name>
                     <description>GPIO input from pin, independent of the Mux selection for the pin or the Direction.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL20[%s]</name>
               <description>GPIO Pin Control Register</description>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <resetValue>0x00008040</resetValue>
               <fields>
                  <field>
                     <name>PU_PD</name>
                     <description>These bits are used to enable an internal pull-up or pull-down resistor.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PWR_GATING</name>
                     <description>The GPIO pin will be tristated when the selected power well is off.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>INTR_DET</name>
                     <description>Determines the interrupt capability of the GPIO input.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EDGE_EN</name>
                     <description>Determines the interrupt capability of the GPIO input.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OUT_BUFF_TYPE</name>
                     <description>0 = Push-Pull, 1 = Open Drain</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_DIR</name>
                     <description>Buffer direction when GPIO selected by pin mux 0 = Input, 1 = Output</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_OUT_SEL</name>
                     <description>GPIO outputs registe select.0=GPIO ALTERNATE_GPIO_DATA 1=GPIO Output Register.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>1=Inverted; 0=Non-inverted</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MUX_CTRL</name>
                     <description>00 = GPIO Function, 01 = Function 1, 10 = Function 2, 11 = Function 3.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>INP_DIS</name>
                     <description>GPIO input disable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALT_GPIO_DATA</name>
                     <description>GPIO Alternate Data Register.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_INP</name>
                     <description>GPIO input from pin, independent of the Mux selection for the pin or the Direction.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
