Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12084.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>HTM0</name>
         <version>291.0</version>
         <description>The Hibernation Timer can generate a wake event to the Embedded Controller (EC) when it is in a hibernation mode</description>
         <groupName>HTM</groupName>
         <prependToName>HTM_</prependToName>
         <baseAddress>0x40009800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xA</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>HTMR0</name>
            <value>112</value>
         </interrupt>
         <registers>
            <register>
               <name>PRLD</name>
               <description>[15:0] This register is used to set the Hibernation Timer Preload value.</description>
               <addressOffset>0x0</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
            </register>
            <register>
               <name>CTRL</name>
               <description>HTimer Control Register</description>
               <addressOffset>0x4</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CTRL</name>
                     <description>1= The Hibernation Timer has a resolution of 0.125s per LSB, which yields a maximum time in excess of 2 hours.\n     0= The Hibernation Timer has a resolution of 30.5us per LSB, which yields a maximum time of ~2seconds.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNT</name>
               <description>The current state of the Hibernation Timer.</description>
               <addressOffset>0x8</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0x0000</resetValue>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="HTM0">
         <name>HTM1</name>
         <baseAddress>0x40009820</baseAddress>
         <interrupt>
            <name>HTMR1</name>
            <value>113</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>RTOS</name>
         <version>1401.0</version>
         <description>RTOS is a 32-bit timer designed to operate on the 32kHz oscillator which is available during all chip sleep states.</description>
         <baseAddress>0x40007400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>TMR</name>
            <value>111</value>
         </interrupt>
         <registers>
            <register>
               <name>CNT</name>
               <description>RTOS Timer Count Register.</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNTR</name>
                     <description>This register contains the current value of the RTOS Timer counter. This register should be read as a DWORD. There is no latching mechanism \n        of the upper bytes implemented if the register is accessed as a byte or word. Reading the register with byte or word operations may give incorrect results.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRLD</name>
               <description>RTOS Timer Preload Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PRELOAD</name>
                     <description>The this register is loaded into the RTOS Timer counter either when the TIMER_START bit is written with a 1, or when the timer counter counts down to 0 and the AUTO_RELOAD bit is 1.\n      This register must be programmed with a new count value before the TIMER_START bit is set to 1. If this register is updated while the counter is operating, the new count value will only take effect if\n      the counter transitions form 1 to 0 while the AUTO_RELOAD bit is set.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRL</name>
               <description>RTOS Timer Control Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BLK_EN</name>
                     <description>1=RTOS timer counter is enabled\n     0=RTOS timer disabled. All register bits are reset to their default state</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AU_RELOAD</name>
                     <description>1=The the RTOS Timer Preload Register is loaded into the timer counter and the counter is restarted when the counter transitions from 1 to 0\n     0=The timer counter halts when it transitions from 1 to 0 and will not restart.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR_STRT</name>
                     <description>Writing a 1 to this bit will load the timer counter with the RTOS Timer Preload Register and start counting. If the Preload Register is 0, counting will not start and this bit will be cleared to 0.\n     Writing a 0 to this bit will halt the counter and clear its contents to 0. The RTOS timer interrupt will not be generated. This bit is automatically cleared if the AUTO_RELOAD bit is 0 and the\n     timer counter transitions from 1 to 0.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXT_HW_HALT_EN</name>
                     <description>1=The timer counter is halted when the external HALT signal is asserted. Counting is always enabled if HALT is de-asserted.\n     0=The HALT signal does not affect the RTOS Timer</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FW_TMR_HALT</name>
                     <description>1=The timer counter is halted. If the counter was running, clearing this bit will restart the counter from the value at which it halted\n     0=The timer counter, if enabled, will continue to run</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SOFTIRQ</name>
               <description>Soft Interrupt Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWI0</name>
                     <description>Software Interrupt. A write of a '1' to this bit will generate an SWI interrupt to the EC.\n     Writes of a '0' have no effect. Reads return '0'.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWI1</name>
                     <description>Software Interrupt. A write of a '1' to this bit will generate an SWI interrupt to the EC.\n     Writes of a '0' have no effect. Reads return '0'.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWI2</name>
                     <description>Software Interrupt. A write of a '1' to this bit will generate an SWI interrupt to the EC.\n     Writes of a '0' have no effect. Reads return '0'.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWI3</name>
                     <description>Software Interrupt. A write of a '1' to this bit will generate an SWI interrupt to the EC.\n     Writes of a '0' have no effect. Reads return '0'.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
