Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12084.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>WEEK</name>
         <version>761.0</version>
         <description>The Week Timer and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state</description>
         <baseAddress>0x4000AC80</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x28</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>WK</name>
            <value>114</value>
         </interrupt>
         <interrupt>
            <name>WKSUB</name>
            <value>115</value>
         </interrupt>
         <interrupt>
            <name>WKSEC</name>
            <value>116</value>
         </interrupt>
         <interrupt>
            <name>WKSUBSEC</name>
            <value>117</value>
         </interrupt>
         <interrupt>
            <name>SYSPWR</name>
            <value>118</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRL</name>
               <description>Control Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>WT_EN</name>
                     <description>The WT_ENABLE bit is used to start and stop the Week Alarm Counter Register and the Clock Divider Register.\n     The value in the Counter Register is held when the WT_ENABLE bit is not asserted (0) and the count is resumed from the last value when the bit is asserted (1).\n     The 15-Bit Clock Divider is reset to 00h and the Week Alarm Interface is in its lowest power consumption state when the WT_ENABLE bit is not asserted.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWRUP_EN</name>
                     <description>This bit controls the state of the Power-Up Event Output and enables Week POWER-UP Event decoding in the VBAT-Powered Control Interface.\n     1=Power-Up Event Output Enabled\n     0=Power-Up Event Output Disabled and Reset</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALARM_CNT</name>
               <description>Week Alarm Counter Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WK_CNTR</name>
                     <description>While the WT_ENABLE bit is 1, this register is incremented at a 1 Hz rate. Writes of this register may require one second\n     to take effect. Reads return the current state of the register. Reads and writes complete independently of the state of WT_ENABLE.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TMR_COMP</name>
               <description>Week Timer Compare Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x0FFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>WK_COMP</name>
                     <description>A Week Alarm Interrupt and a Week Alarm Power-Up Event are asserted when the Week Alarm Counter Register is greater than\n     or equal to the contents of this register. Reads and writes complete independently of the state of WT_ENABLE.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKDIV</name>
               <description>Clock Divider Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>Reads of this register return the current state of the Week Timer 15- bit clock divider.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SS_INTR_SEL</name>
               <description>Sub-Second Programmable Interrupt Select Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SPISR</name>
                     <description>This field determines the rate at which Sub-Second interrupt events are generated.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWK_CTRL</name>
               <description>Sub-Week Control Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWKTMR_PWRUP_EVT_STS</name>
                     <description>This bit is set to 1 when the Sub-Week Alarm Counter Register decrements from 1 to 0 and the POWERUP_EN is 1.\n     Writes of 1 clear this bit. Writes of 0 have no effect. Note: This bit MUST be cleared to remove a Sub-Week Timer Power-Up Event.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKTMR_PWRUP_EVT_STS</name>
                     <description>This bit is set to 1 when the Week Alarm Counter Register is greater than or equal the contents of the Week Timer Compare\n     Register and the POWERUP_EN is 1. Writes of 1 clear this bit. Writes of 0 have no effect.\n     Note: This bit does not have to be cleared to remove a Week Timer Power-Up Event.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST</name>
                     <description>Test</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST0</name>
                     <description>Test</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AU_RLD</name>
                     <description>1= No reload occurs when the Sub-Week Counter expires\n     0= Reloads the SUBWEEK_COUNTER_LOAD field into the Sub- Week Counter when the counter expires.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWK_TICK</name>
                     <description>This field selects the clock source for the Sub-Week Counter.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWK_ALARM</name>
               <description>Sub-Week Alarm Counter Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNTR_LOAD</name>
                     <description>Writes with a non-zero value to this field reload the 9-bit Sub-Week Alarm counter. Writes of 0 disable the counter.\n     If the Sub-Week Alarm counter decrements to 0 and the AUTO_RELOAD bit is set, the value in this field is automatically loaded into the Sub-Week Alarm counter.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>CNTR_STS</name>
                     <description>Reads of this register return the current state of the 9-bit Sub-Week Alarm counter.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BGPO_DATA</name>
               <description>BGPO Data Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DAT</name>
                     <description>Battery powered General Purpose Output. Each output pin may be individually configured to be either a VBAT-power BGPO or a VTR\n     powered GPIO, based on the corresponding settings in the BGPO Power Register. Additionally, each output pin may be individually configured\n     to reset to 0 on either RESET_VTR or RESET_SYS, based on the corresponding settings in the BGPO Reset Register.\n     For each bit [i] in the field: 1=BGPO[i] output is high; 0=BGPO[i] output is low.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BGPO_PWR</name>
               <description>BGPO Power Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000007</resetValue>
               <fields>
                  <field>
                     <name>PWR</name>
                     <description>Battery powered General Purpose Output power source. For each bit [i] in the field:\n     1=BGPO[i] is powered by VBAT. The BGPO[i] pin is always determined by the corresponding bit in the BGPO Data Register. The GPIO Input register\n     for the GPIO that is multiplexed with the BGPO always returns a '1b'.\n     0=The pin for BGPO[i] functions as a GPIO. When VTR is powered, the pin associated with BGPO[i] is determined by the GPIO associated with the pin.\n     When VTR is unpowered, the pin is tristated.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BGPO_RST</name>
               <description>BGPO Reset Register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RST</name>
                     <description>Battery powered General Purpose Output reset event. For each bit [i] in the field:\n     1=BGPO[i] is reset to 0 on RESET_VTR; 0=BGPO[i] is reset to 0 on RESET_SYS.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
