Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12084.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="TACH0">
         <name>TACH2</name>
         <baseAddress>0x40006020</baseAddress>
         <interrupt>
            <name>TACH2</name>
            <value>73</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>PWM0</name>
         <version>541.0</version>
         <description>The PWM block generates an arbitrary duty cycle output at frequencies from less than 0.1 Hz to 24 MHz</description>
         <groupName>PWM</groupName>
         <prependToName>PWM_</prependToName>
         <baseAddress>0x40005800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CNT_ON</name>
               <description>This field determines both the frequency and duty cycle of the PWM signal. Setting this field to a value of n will\n    cause the On time of the PWM to be n+1 cycles of the PWM Clock Source.\n    When this field is set to zero and the PWMX_COUNTER_OFF_TIME is not set to zero, the PWM_OUTPUT is held low (Full Off).</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CNT_OFF</name>
               <description>This field determine both the frequency and duty cycle of the PWM signal. Setting this field to a value of n will\n    cause the Off time of the PWM to be n+1 cycles of the PWM Clock Source.\n    When this field is set to zero, the PWM_OUTPUT is held high (Full On).</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
            </register>
            <register>
               <name>CFG</name>
               <description>PWMx CONFIGURATION REGISTER</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM_EN</name>
                     <description>When the PWM_ENABLE is set to 0 the internal counters are reset and the internal state machine is set to the OFF state.\n     In addition, the PWM_OUTPUT signal is set to the inactive state as determined by the Invert bit. The PWMx Counter ON Time Register\n     and PWMx Counter OFF Time Register are not affected by the PWM_ENABLE bit and may be read and written while the PWM enable bit is 0.\n     1=Enabled (default); 0=Disabled (gates clocks to save power).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLK_SEL</name>
                     <description>This bit determines the clock source used by the PWM duty cycle and frequency control logic.\n                  1=CLOCK_LOW\n                  0=CLOCK_HIGH</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INV</name>
                     <description>1= PWM_OUTPUT ON State is active low; 0=PWM_OUTPUT ON State is active high.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLK_PRE_DIV</name>
                     <description>The Clock source for the 16-bit down counter (see PWMx Counter ON Time Register and PWMx Counter OFF Time Register)\n     is determined by bit D1 of this register. The Clock source is then divided by the value of Pre-Divider+1 and the resulting\n     signal determines the rate at which the down counter will be decremented. For example, a Pre-Divider value of 1 divides\n     the input clock by 2 and a value of 2 divides the input clock by 3. A Pre-Divider of 0 will disable the Pre-Divider option.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="PWM0">
         <name>PWM1</name>
         <baseAddress>0x40005810</baseAddress>
      </peripheral>
      <peripheral derivedFrom="PWM0">
         <name>PWM4</name>
         <baseAddress>0x40005840</baseAddress>
      </peripheral>
      <peripheral derivedFrom="PWM0">
         <name>PWM6</name>
         <baseAddress>0x40005860</baseAddress>
      </peripheral>
      <peripheral derivedFrom="PWM0">
         <name>PWM7</name>
         <baseAddress>0x40005870</baseAddress>
      </peripheral>
      <peripheral>
         <name>ADC</name>
         <version>1771.0</version>
         <description>This block is designed to convert external analog voltage readings into digital values.</description>
         <baseAddress>0x40007C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x90</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>ADC_SNGL</name>
            <value>78</value>
         </interrupt>
         <interrupt>
            <name>ADC_RPT</name>
            <value>79</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRL</name>
               <description>The ADC Control Register is used to control the behavior of the Analog to Digital Converter.</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00010106</resetValue>
               <fields>
                  <field>
                     <name>ACT</name>
                     <description>0: The ADC is disabled and placed in its lowest power state. 1: ADC block is enabled for operation.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STRT_SIN</name>
                     <description>(START_SINGLE) 0: The ADC Single Mode is disabled. 1: The ADC Single Mode is enabled. Note: This bit is self-clearing</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STRT_RPT</name>
                     <description>0: The ADC Repeat Mode is disabled. 1: The ADC Repeat Mode is enabled.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWR_SAV_DIS</name>
                     <description>0: Power saving feature is enabled. 1: Power saving feature is disabled.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFT_RST</name>
                     <description>(SOFT_RESET) 1: writing one causes a reset of the ADC block hardware (not the registers) 0: writing zero takes the ADC block out of reset</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RPT_DONE_STS</name>
                     <description>0: ADC repeat-sample conversion is not complete. 1: ADC repeat-sample conversion is completed. (R/WC)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIN_DONE_STS</name>
                     <description>0: ADC single-sample conversion is not complete. 1: ADC single-sample conversion is completed. (R/WC)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DELAY</name>
               <description>The ADC Delay register determines the delay from setting Start_Repeat in the ADC Control Register and the start of a conversion cycle. This register also controls the interval between conversion cycles in repeat mode.</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STRT_DLY</name>
                     <description>This field determines the starting delay before a conversion cycle is begun when Start_Repeat is written with a 1.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>RPT_DLY</name>
                     <description>This field determines the interval between conversion cycles when Start_Repeat is 1.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHAN_STS</name>
               <description>The ADC Status Register indicates whether the ADC has completed a conversion cycle. All bits are cleared by being written with a 1. \n            0: conversion of the corresponding ADC channel is not complete\n            1: conversion of the corresponding ADC channel is complete</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STS</name>
                     <description>All bits are cleared by being written with a '1'. 1=conversion of the corresponding ADC channel is complete;\n      0=conversion of the corresponding ADC channel is not complete. For enabled single cycles, the SINGLE_DONE_STATUS bit in the\n      ADC Control Register is also set after all enabled channel conversion are done; for enabled repeat cycles, the REPEAT_DONE_STATUS\n      in the ADC Control Register is also set after all enabled channel conversion are done.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SNG_EN</name>
               <description>The ADC Single Register is used to control which ADC channel is captured during a Single-Sample conversion cycle initiated by the Start_Single bit in the ADC Control Register. \n            APPLICATION NOTE: Do not change the bits in this register in the middle of a conversion cycle to insure proper operation.\n            0: single cycle conversions for this channel are disabled\n            1: single cycle conversions for this channel are enabled</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>S_EN</name>
                     <description>Each bit in this field enables the corresponding ADC channel when a single cycle of conversions is started when the\n      START_SINGLE bit in the ADC Control Register is written with a 1. 1=single cycle conversions for this channel are enabled\n      0=single cycle conversions for this channel are disabled. Note: If this register is changed while a conversion.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>REPT_EN</name>
               <description>The ADC Repeat Register is used to control which ADC channels are captured during a repeat conversion cycle initiated by the Start_Repeat bit in the ADC Control Register.</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>R_EN</name>
                     <description>Each bit in this field enables the corresponding ADC channel for each pass of the Repeated ADC Conversion that is\n      controlled by bit START_REPEAT in the ADC Control Register. 1=repeat conversions for this channel are enabled;\n      0=repeat conversions for this channel are disabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>CHAN_RD[%s]</name>
               <description>All 16 ADC channels return their results into a 32-bit reading register. In each case the low 10 bits of the reading register\n     return the result of the Analog to Digital conversion and the upper 22 bits return 0.</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFG</name>
               <description>The ADC Configuration Register is used to configure the ADC clock timing.</description>
               <addressOffset>0x7C</addressOffset>
               <size>32</size>
               <resetValue>0x00000101</resetValue>
               <fields>
                  <field>
                     <name>CLKLW_TIM</name>
                     <description>These bits define the low time count of the ADC clock.\n         0= not used.\n         1= 1 System Clock.\n         2= 2 System Clock.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CLKHIGH_TIM</name>
                     <description>These bits define the high time count of the ADC clock.\n         0= not used.\n         1= 1 System Clock.\n         2= 2 System Clock.\n</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CLKDUMY_TIM</name>
                     <description>These bits define the dummy cycles of the ADC clock.\n         Valid Values are from 0x0 to 0xF.\n</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PWRUP_DLY</name>
                     <description>These bits define the power up delay in number of micro-seconds.\n         Valid Values are from 0x0 to 0xF.\n</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DUMYCYC_GAP</name>
                     <description>These bits define the number of micro-seconds between consective Starts.\n</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VREF_CHAN</name>
               <description>The ADC Channel Register is used to configure the reference voltage to the clock timing.\n</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SEL0</name>
                     <description>These bits define the reference voltage for Channel 0.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL1</name>
                     <description>These bits define the reference voltage for Channel 1.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL2</name>
                     <description>These bits define the reference voltage for Channel 2.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL3</name>
                     <description>These bits define the reference voltage for Channel 3.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL4</name>
                     <description>These bits define the reference voltage for Channel 4.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL5</name>
                     <description>These bits define the reference voltage for Channel 5.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL6</name>
                     <description>These bits define the reference voltage for Channel 6.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL7</name>
                     <description>These bits define the reference voltage for Channel 7.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL8</name>
                     <description>These bits define the reference voltage for Channel 8.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL9</name>
                     <description>These bits define the reference voltage for Channel 9.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL10</name>
                     <description>These bits define the reference voltage for Channel 10.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL11</name>
                     <description>These bits define the reference voltage for Channel 11.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL12</name>
                     <description>These bits define the reference voltage for Channel 12.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL13</name>
                     <description>These bits define the reference voltage for Channel 13.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL14</name>
                     <description>These bits define the reference voltage for Channel 14.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL15</name>
                     <description>These bits define the reference voltage for Channel 15.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VREF_CTRL</name>
               <description>This is the VREF Control Register</description>
               <addressOffset>0x84</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHRG_DLY</name>
                     <description>This field represnts the delay time to charge up the external VREF capacitor.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>SWITCH_DLY</name>
                     <description>This field represnts the delay time interval between switching VREF Selects.\n</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>PADCTRL</name>
                     <description>This fields give the choice to the application whether to float the unused PAD's or to Drive them to 0.\n         1= Drive unused PAD's Low 0b\n         0= Leave unused PAD's Floating.\n</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SELSTAT</name>
                     <description>This fields gives information about the current VREF selected.\n         0x0= VREF0\n         0x1= VREF1\n         0x2= Reserved\n         0x3= Reserved\n</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
