Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12084.svd
            <register>
               <name>SAR_CTRL</name>
               <description>This is the SAR ADC Control Register.\n</description>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <resetValue>0x00000006</resetValue>
               <fields>
                  <field>
                     <name>SEL_DIFF</name>
                     <description>This field select between Single ended / Differential input.\n    0= ADC core is enabled for single ended input operation.\n    1= ADC core is enabled for differential input operation.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SEL_RES</name>
                     <description>This field select the ADC Resolution (10/12 bits).\n    0x0= Reserved.\n    0x1= Reserved.\n    0x2= 10 bit ADC resolution.\n    0x3= 12 bit ADC resolution.\n</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SHIFT_DAT</name>
                     <description>This field defined if the ADC output is Right or Left Justified.\n         1= adc_dout is not shifted and lower bits are set to 0.\n         0= adc_dout is shifted right following resolution selected.\n</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN_ASYN_SMPL</name>
                     <description>This field enables asynchronous sampling.\n         0= Async Sampling Disabled.\n         1= Async Sampling Enabled.\n</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN_SERIAL</name>
                     <description>This field enables serial output (dout) from ADC.\n         0= Parallel dout.\n         1= Serial dout.\n</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WARM_UP_DLY</name>
                     <description>This field represents the warmup delay number in microseconds.\n</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SAR_CFG</name>
               <description>This is the SAR ADC Configuration Register.\n</description>
               <addressOffset>0x8C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN_CMBF</name>
                     <description>Enable Common Mode Buffer Amplifier.\n    0= Common Mode Buffer Amplifier is high all the time.\n    1= Controls Common Mode Buffer Amplifier during power cycling.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS_DOUT</name>
                     <description>Disable Parallel Output.\n    0= Enable Parallel Output.\n    1= Disable Parallel Output.\n</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN_DITHER</name>
                     <description>Enable Dithering.\n    0= Disable Dither.\n    1= Enable Dither.\n</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAZ_AU_ZERO</name>
                     <description>Enable F_AZ AUTOZEROING.\n    1= Disable f_az autozeroing.\n    0= Enable f_az autozeroing.\n</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAZ_AU_ZERO</name>
                     <description>Enable S_AZ AUTOZEROING.\n    1= Disable S_AZ autozeroing.\n    0= Enable S_AZ autozeroing.\n</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAZ_AU_ZERO</name>
                     <description>Enable L_AZ AUTOZEROING.\n    1= Disable L_AZ autozeroing.\n    0= Enable L_AZ autozeroing.\n</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN_RADC</name>
                     <description>Enable RADC.\n    1 = RDAC remains high during power cycling.\n    0 = Controls RDAC during power cycling.\n</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REGEN_DLY</name>
                     <description>This register defines the delay between regen and latch.\n</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CLK_DIV</name>
                     <description>This register defines the programmable ADC Clock divider value.         Divider ratios of 256,128,64,32,16 are supported.\n</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>IADC_RANGE2</name>
                     <description>This register controls the current consumption for the whole ADC.\n</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>IADC_RANGE1</name>
                     <description>This register controls the current consumption for the whole ADC.\n</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ICMBF_STG1</name>
                     <description>This register controls the bias current for the 1st stage of the comparator.\n</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ICMBF_STG2</name>
                     <description>This register controls the bias current for the 2nd stage of the comparator.\n</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ICMBF</name>
                     <description>This register controls the bias current for common mode buffer amplifier.\n</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EN_EXT_BIAS</name>
                     <description>EN external bias.\n    1 = Disables internal switched cap bias circuit.\n    0 = Enables internal switched cap bias circuit.\n</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
