Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12084.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>LED0</name>
         <version>1111.0</version>
         <description>The LED is implemented using a PWM that can be driven either by the 48 MHz clock or by a 32.768 KHz clock input.</description>
         <groupName>LED</groupName>
         <prependToName>LED_</prependToName>
         <baseAddress>0x4000B800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x18</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>LED0</name>
            <value>83</value>
         </interrupt>
         <registers>
            <register>
               <name>CFG</name>
               <description>LED Configuration</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00001400</resetValue>
               <fields>
                  <field>
                     <name>CTRL</name>
                     <description>CONTROL 3=PWM is always on\n                  2=LED blinking (standard PWM)\n                  1=LED breathing configuration\n                  0=PWM is always off. All internal registers and counters are reset to 0. Clocks are gated</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CLK_SRC</name>
                     <description>1=Clock source is the 48 MHz clock, 0=Clock source is the 32.768 KHz clock</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCH</name>
                     <description>SYNCHRONIZE  When this bit is '1', all counters for all LEDs are reset to their initial values. When this bit is '0' in the LED Configuration Register for all LEDs, then all counters for LEDs that are configured to blink or breathe will increment or decrement, as required.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM_SIZE</name>
                     <description>PWM_SIZE This bit controls the behavior of PWM:\n                  3=Reserved\n                  2=PWM is configured as a 6-bit PWM\n                  1=PWM is configured as a 7-bit PWM\n                  0=PWM is configured as an 8-bit PWM</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EN_UPDATE</name>
                     <description>ENABLE_UPDATE  This bit is set to 1 when written with a '1'. Writes of '0' have no effect. Hardware clears this bit to 0 when the breathing configuration registers are updated at the end of a PWM period. The current state of the bit is readable any time.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST</name>
                     <description>RESET  Writes of '1' to this bit resets the PWM registers to their default values. This bit is self clearing. Writes of '0' to this bit have no effect.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT_RELOAD</name>
                     <description>WDT_RELOAD  The PWM Watchdog Timer counter reload value. On system reset, it defaults to 14h, which corresponds to a 4 second Watchdog timeout value.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SYMMETRY</name>
                     <description>SYMMETRY  1=The rising and falling ramp times are in Asymmetric mode.\n                  0=The rising and falling ramp times are in Symmetric mode.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LIMIT</name>
               <description>LED Limits This register may be written at any time. Values written into the register are held in an holding register, which is transferred into the actual register at the end of a PWM period. The two byte fields may be written independently. Reads of this register return the current contents and not the value of the holding register.</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MIN</name>
                     <description>In breathing mode, when the current duty cycle is less than or equal to this value the breathing apparatus holds the current duty cycle for the period specified by the field LD in register LED_DELAY, then starts incrementing the current duty cycle In blinking mode, this field defines the duty cycle of the blink function.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MAX</name>
                     <description>In breathing mode, when the current duty cycle is greater than or equal to this value the breathing apparatus holds the current duty cycle for the period specified by the field HD in register LED_DELAY, then starts decrementing the current duty cycle</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DLY</name>
               <description>LED Delay</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LOW_PULSE</name>
                     <description>The number of PWM periods to wait before updating the current duty cycle when the current duty cycle is greater than or equal to the value MIN in register LED_LIMIT.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>HIGH_PULSE</name>
                     <description>In breathing mode, the number of PWM periods to wait before updating the current duty cycle when the current duty cycle is greater than or equal to the value MAX in register LED_LIMIT.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STEP</name>
               <description>This register has eight segment fields which provide the amount the current duty cycle is adjusted at the end of every PWM period. Segment field selection is decoded based on the segment index. The segment index equation utilized depends on the SYMMETRY bit in the LED Configuration Register Register)              . In Symmetric Mode the Segment_Index[2:0] = Duty Cycle Bits[7:5]\n              . In Asymmetric Mode the Segment_Index[2:0] is the bit concatenation of following: Segment_Index[2] = (FALLING RAMP TIME in Figure 30-3, Clipping Example) and Segment_Index[1:0] = Duty Cycle Bits[7:6].</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>S0</name>
                     <description>Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 000.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>S1</name>
                     <description>Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 001.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>S2</name>
                     <description>Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 010.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>S3</name>
                     <description>Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 011.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>S4</name>
                     <description>Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 100.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>S5</name>
                     <description>Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 101</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>S6</name>
                     <description>Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 110.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>S7</name>
                     <description>Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 111.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTRVL</name>
               <description>LED Update Interval</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>I0</name>
                     <description>The number of PWM periods between updates to current duty cycle when the segment index is equal to 000b.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>I1</name>
                     <description>The number of PWM periods between updates to current duty cycle when the segment index is equal to 001b.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>I2</name>
                     <description>The number of PWM periods between updates to current duty cycle when the segment index is equal to 010b.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>I3</name>
                     <description>The number of PWM periods between updates to current duty cycle when the segment index is equal to 011b.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>I4</name>
                     <description>The number of PWM periods between updates to current duty cycle when the segment index is equal to 100b.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>I5</name>
                     <description>The number of PWM periods between updates to current duty cycle when the segment index is equal to 101b.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>I6</name>
                     <description>The number of PWM periods between updates to current duty cycle when the segment index is equal to 110b.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>I7</name>
                     <description>The number of PWM periods between updates to current duty cycle when the segment index is equal to 111b.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OUTDLY</name>
               <description>LED Output Delay</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DELAY</name>
                     <description>The delay, in counts of the clock defined in Clock Source (CLKSRC), in which output transitions are delayed.\n     When this field is 0, there is no added transition delay. When the LED is programmed to be Always On or Always Off, the\n     Output Delay field has no effect.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
