Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12084.svd
            <register>
               <name>BLKID</name>
               <description>Block ID Register</description>
               <addressOffset>0x30</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Block ID.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BLKREV</name>
               <description>Revision Register</description>
               <addressOffset>0x34</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>REV</name>
                     <description>Block Revision Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BB_CTRL</name>
               <description>Bit-Bang Control Register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <resetValue>0x00000060</resetValue>
               <fields>
                  <field>
                     <name>BBEN</name>
                     <description>Bit-Bang Mode Enable. 0 - Bit Bang Mode Disabled. 1 - Bit Bang Mode Enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLDIR</name>
                     <description>Bit-Bang Clock Direction. The CLDIR bit controls the direction of SCLK. 0 - Input, 1 - Output</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DADIR</name>
                     <description>Bit-Bang Data Direction. The DADIR bit controls the direction of SDAT. 0 - Input. 1 - Output</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBCLK</name>
                     <description>Bit-Bang Clock. The BBCLK bit controls the state of SCLK when BBEN = and CLDIR = '1'</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBDAT</name>
                     <description>Bit-Bang Data. The BBDAT bit controls the state of SDAT when BBEN = and DADIR = '1'</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBCLKI</name>
                     <description>Bit-Bang Clock In. The BBCLKI bit always returns the state of SCLK.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBDATI</name>
                     <description>Bit-Bang Data In. The BBDATI bit always returns the state of SDAT</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKSYNC</name>
               <description>This is Clock Sync Register. This register must not be written, or undesirable results may occur.\n</description>
               <addressOffset>0x3C</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CLK_SYNC</name>
                     <description>This register must not be written, or undesirable results may occur.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DATATM</name>
               <description>Data Timing Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x0C4D5006</resetValue>
               <fields>
                  <field>
                     <name>DATA_HOLD</name>
                     <description>The Data Hold [7:0] timer determines the SDAT hold time following SCLK driven low.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RESTART_SETUP</name>
                     <description>The Restart Setup [7:0] timer determines the SDAT setup time from the rising edge of SCLK for a repeated START condition.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>STOP_SETUP</name>
                     <description>The Stop Setup [7:0] timer determines the SDAT setup time from the rising edge of SCLK for a STOP condition.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FIRST_START_HOLD</name>
                     <description>This field determines the SCL hold time following SDA driven low during the first START bit in a transfer. It is the parameter\n      THD:STA in the I2C Specification for an initial START bit. Repeated START hold time is determined by the Repeated START Hold Time Register.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TMOUTSC</name>
               <description>Time-Out Scaling Register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x4B9CC2C7</resetValue>
               <fields>
                  <field>
                     <name>BUS_IDLE_MIN</name>
                     <description>Bus Idle Minimum time = Bus Idle Min [7:0] x Baud_Clock_Period</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WAKE_STS</name>
               <description>WAKE STATUS Register</description>
               <addressOffset>0x60</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>START_BIT_DET</name>
                     <description>This bit is set to '1' when a START bit is detected while the controller is enabled. This bit is cleared to '0' when\n      written with a '1'. Writes of '0' have no effect. (R/WC)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WAKE_EN</name>
               <description>WAKE ENABLE Register</description>
               <addressOffset>0x64</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>START_DET_INT_EN</name>
                     <description>Enable Start Bit Detection Interrupt. The Start Bit Detection Interrupt is wake-capable.\n         1=Start Bit Detection Interrupt enabled. \n         0=Start Bit Detection Interrupt disabled.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLV_ADDR</name>
               <description>This is the Slave Address Register.\n</description>
               <addressOffset>0x6C</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SADDR</name>
                     <description>This register stores the value of the Slave Address and Direction Bit from the 1st byte of a Slave transfer.\n    This is loaded immediately upon receipt of the address byte, before the ACK/NAK 9th clock. \n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRM_STS</name>
               <description>This is the Promiscuous Interrupt Register. This register bit will be functional only in Promiscuous mode.\n</description>
               <addressOffset>0x70</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ADDR_INTR</name>
                     <description>This is the Promiscuous Address Status interrupt. This bit is functional only in Promiscuous mode. This bit is set \n         on the 8th clock of the I2C Address. This bit will hold the Clock line low till this register bit is cleared. In other words, \n         Software should read the address program ACK/NAK and clear this bit for the ACK/NAK clock to appear on the I2C clock (SCL) line. \n         This is Write 1 to clear. R/W1C.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRM_IEN</name>
               <description>This is the Promiscuous Interrupt Enable Register.\n</description>
               <addressOffset>0x74</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>This is the Promiscuous interrupt enable register.\n         1= Interrupt Enable. \n         0= Interrupt Disabled. \n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRM_CTRL</name>
               <description>This is the Promiscuous Control Register. This register is functional only in Promiscuous mode.\n</description>
               <addressOffset>0x78</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ACK_NAK</name>
                     <description>This is the Promiscuous ACK / NAK response register. This bit has no effect in Normal mode of operation.\n         1= ACK the address byte. \n         0= NAK the address byte. \n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
