Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12084.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="PORT_80_DEBUG0">
         <name>PORT_80_DEBUG1</name>
         <baseAddress>0x400F8400</baseAddress>
         <interrupt>
            <name>P80CAP1</name>
            <value>63</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>VCI</name>
         <version>751.0</version>
         <description>The VBAT-Powered Control Interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm.</description>
         <baseAddress>0x4000AE00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x24</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>VCI_OVRD_IN</name>
            <value>121</value>
         </interrupt>
         <interrupt>
            <name>VCI_IN0</name>
            <value>122</value>
         </interrupt>
         <interrupt>
            <name>VCI_IN1</name>
            <value>123</value>
         </interrupt>
         <interrupt>
            <name>VCI_IN2</name>
            <value>124</value>
         </interrupt>
         <interrupt>
            <name>VCI_IN3</name>
            <value>125</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRL_STS</name>
               <description>VCI Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000080</resetValue>
               <fields>
                  <field>
                     <name>VCI_IN</name>
                     <description>These bits provide the latched state of the associated VCI_IN# pin, if latching is enabled or the current state of the pin\n     if latching is not enabled. In both cases, the value is determined after the action of the VCI Polarity Register.\n     Note: The VCI_IN[6:0]# bits default to the state of their respective input pins.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>VCI_OUT_GPIO_SEL</name>
                     <description>This bit selects the power source for GPIO outputs.\n    1= GPIO will be powered by VBAT power well (VCI_OUT functionality).\n    0= GPIO will be powered by VTR power well.\n</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VCI_OVRD_IN</name>
                     <description>This bit provides the current status of the VCI_OVRD_IN pin.\n     Note: The VCI_OVRD_IN bit defaults to the state of the respective input pin.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VCI_OUT</name>
                     <description>This bit provides the current status of the VCI_OUT pin.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VCI_FW_CTRL</name>
                     <description>This bit can allow EC firmware to control the state of the VCI_OUT pin. For example, when VTR_PWRGD is asserted and the\n     FW_EXT bit is 1, clearing the VCI_FW_CNTRL bit de-asserts the active high VCI_OUT pin. BIOS must set this bit to 1 prior to setting\n     the FW_EXT bit to 1 on power up, in order to avoid glitches on the VCI_OUT pin.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FW_EXT</name>
                     <description>This bit controls selecting between the external VBAT-Powered Control Interface inputs, or the VCI_FW_CNTRL bit output to control the VCI_OUT pin.\n     1=VCI_OUT is determined by the VCI_FW_CNTRL field, when VTR is active\n     0=VCI_OUT is determined by the external inputs.\n     Note: This bit used to be called GPO/nEXT. The name was changed to distinguish it from the BGPOs, which are elsewhere, and to remove a / in a bit name.</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLTRS_BYPASS</name>
                     <description>The Filters Bypass bit is used to enable and disable the input filters on the VCI_IN# pins.\n     1=Filters disabled; 0=Filters enabled (default).</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WK_ALRM</name>
                     <description>If enabled by WEEK_ALRM_LE, this bit is set to 1 if the Week Alarm signal is asserted. It is reset by writes to WEEK_ALRM_LS.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC_ALRM</name>
                     <description>If enabled by RTC_ALRM_LE, this bit is set to 1 if the RTC Alarm signal is asserted. It is reset by writes to RTC_ALRM_LS.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYSPWR_PRES</name>
                     <description>This is the System power present select bit.\n    1= VCI_IN3 is used as System power present.\n    0= VCI_IN3 is used as VCI_IN3.\n</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LATCH_EN</name>
               <description>Latch Enable Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LE</name>
                     <description>Latching Enables. Latching occurs after the Polarity configuration, so a VCI_INi# pin is asserted when it is '0' if VCI_IN_POL is '0', and asserted when it is '1' if VCI_IN_POL is '1'.\n     For each bit in the field:\n     1=Enabled. Assertions of the VCI_INi# pin are held until the latch is reset by writing the corresponding LS bit\n     0=Not Enabled. The VCI_INi# signal is not latched but passed directly to the VCI_OUT logic</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>WK_ALRM_LE</name>
                     <description>Latch enable for the Week Alarm Power-Up signal.\n     1=Enabled. Assertions of the Week Alarm are held until the latch is reset by writing the corresponding LS bit\n     0=Not Enabled. The Week Alarm signal is not latched but passed directly to the VCI_OUT logic</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC_ALRM_LE</name>
                     <description>Latch enable for the RTC Power-Up signal.\n     1=Enabled. Assertions of the RTC Alarm are held until the latch is reset by writing the corresponding LS bit\n     0=Not Enabled. The RTC Alarm signal is not latched but passed directly to the VCI_OUT logic</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LATCH_RST</name>
               <description>Latch Resets Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LS</name>
                     <description>Latch Resets. When a Latch Resets bit is written with a '1', the corresponding VCI_INi# latch is de-asserted ('1'). The VCI_INi#\n     input to the latch has priority over the Latch Reset input, so firmware cannot reset the latch while the VCI_INi# pin is asserted. Firmware\n     should sample the state of the pin in the VCI Register before attempting to reset the latch. As noted in the Latch Enable Register,\n     the assertion level is determined by the VCI_IN_POL bit. Reads of this register are undefined.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>WK_ALRM_LS</name>
                     <description>Week Alarm Latch Reset. When this bit is written with a '1', the Week Alarm Event latch is reset.\n     The Week Alarm input to the latch has priority over the Reset input Reads of this register are undefined.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC_ALRM_LS</name>
                     <description>RTC Alarm Latch Reset. When this bit is written with a '1', the RTC Alarm Event latch is reset.\n     The RTC Alarm input to the latch has priority over the Reset input Reads of this register are undefined.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INPUT_EN</name>
               <description>VCI Input Enable Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000007</resetValue>
               <fields>
                  <field>
                     <name>IE</name>
                     <description>Input Enables for VCI_IN# signals. After changing the input enable for a VCI input, firmware should reset the input latch and clear\n     any potential interrupt that may have been triggered by the input, as changing the enable may cause the internal status to change.\n     For each bit in the field:\n     1=Enabled. The corresponding VCI_IN# input is not gated and toggling the pin will affect the VCI_OUT pin\n     0=Not Enabled. the corresponding VCI_IN# input does not affect the VCI_OUT pin, even if the input is '0'. Unless the corresponding bit\n     in the VCI Buffer Enable Register is 1, latches are not asserted, even if the VCI_IN# pin is low, during a VBAT power transition</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HLDOFF_CNT</name>
               <description>Holdoff Count Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIME</name>
                     <description>These bits determine the period of time the VCI_OUT logic is inhibited from re-asserting VCI_OUT after a SYS_SHDN# event.\n     FFh-01h=The Power On Inhibit Holdoff Time is set to a period between 125ms and 31.875 seconds.\n     0=The Power On Inhibit function is disabled.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>POLARITY</name>
               <description>VCI Polarity Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VCI_IN</name>
                     <description>These bits determine the polarity of the VCI_IN input signals: For each bit in the field:\n     1=Active High. The value on the pins is inverted before use\n     0=Active Low (default).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PEDGE_DET</name>
               <description>VCI Posedge Detect Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VCI_IN</name>
                     <description>These bits record a low to high transition on the VCI_IN# pins. A 1 indicates a transition occurred. For each bit in the field:\n     1=Positive Edge Detected; 0=No edge detected.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NEDGE_DET</name>
               <description>VCI Negedge Detect Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VCI_IN</name>
                     <description>These bits record a high to low transition on the VCI_IN# pins. A 1 indicates a transition occurred. For each bit in the field:\n     1=Negative Edge Detected; 0=No edge detected.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BUFFER_EN</name>
               <description>VCI Buffer Enable Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>V_BUF</name>
                     <description>Input Buffer enable. After changing the buffer enable for a VCI input, firmware should reset the input latch and clear any\n     potential interrupt that may have been triggered by the input, as changing the buffer may cause the internal status to change. This register\n     has no effect when VTR is powered. When VTR is on, the input buffers are enabled only by the IE bit. For each bit in the field:\n     1=VCI_IN# input buffer enabled independent of the IE bit. The edge detection latches for this input are always enabled\n     0=VCI_IN# input buffer enabled by the IE bit. The edge detection latches are only enabled when the IE bit is 1 (default).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
