Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12084.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="SGPIO0">
         <name>SGPIO1</name>
         <baseAddress>0x4000A100</baseAddress>
         <interrupt>
            <name>SGPIO1</name>
            <value>162</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>OTP</name>
         <version>961.0</version>
         <description>OTP Programming registers.\n</description>
         <baseAddress>0x40082000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x4C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>GIRQ20</name>
            <value>12</value>
         </interrupt>
         <registers>
            <register>
               <name>WRLOCK</name>
               <description>This is the Write Lock Register.\n</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WL</name>
                     <description>When any of the bits are set, the corresponding 32byte range in the OTP is not writable.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RDLOCK</name>
               <description>This is the Read Lock Register.\n</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RDLOCK</name>
                     <description>When any of the bits are set, the corresponding 32byte range in the OTP is not readable.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SPI_SLAVE</name>
         <version>1701.0</version>
         <description>SPI Slave Register.</description>
         <baseAddress>0x40007000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x4C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SPISLV</name>
            <value>90</value>
         </interrupt>
         <registers>
            <register>
               <name>SPI_CFG</name>
               <description>SPI Slave Communication Configuration Register.\n</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00040000</resetValue>
               <fields>
                  <field>
                     <name>SNG_QUD_SEL</name>
                     <description>This field defines the Single / Quad Wire mode of operation for SPI Slave block.         0 = Single Wire Slave SPI block operation.\n         1 = Quad Wire Slave SPI block operation.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAR_TIM_SEL</name>
                     <description>Turn Around Time select for Quad wire mode.\n         0h = 1 cycle.         1h = 2 cycles.         2h = 4 cycles.         3h = 8 cycles.         Other values are reserved.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>WAIT_TIME</name>
                     <description>These bits set the amount of wait time in cycles before transmitting data back to master.\n         During this wait time status bits will be transmitted\n</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPI_STS</name>
               <description>SPI Slave Status Register.\n</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000500</resetValue>
               <fields>
                  <field>
                     <name>MEM_WR_DONE</name>
                     <description>When the ARM BUS side has fully finished the last transaction from the FIFO to write the data to\n         Memory for Posted Writes . Clear with new Write request.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_RD_DONE</name>
                     <description>When the ARM BUS side has fully finished writing the last written DWord to the FIFO for a set of data\n         read from Memory for Posted Reads. - cleared with new Read request.\n</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_WR_BUSY</name>
                     <description>When an Memory Write transaction is currently being processed.\n</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_RD_BUSY</name>
                     <description>When an Memory Read transaction is currently being processed.\n</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SREG_TRANS</name>
                     <description>When an SREG transaction is currently being processed.\n</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POLL_HIGH</name>
                     <description>If this bit is set, then something in the high 16-bit of status register is set and needs to be checked.\n         SPI Master should take action to clear this.\n</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_EMP</name>
                     <description>Signifies all Memory write transactions for the SPI Masters requested size have been performed.\n         New transactions are allowed.\n</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_FUL</name>
                     <description>The RX FIFO is full of data to be written to Memory.\n</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_EMP</name>
                     <description>Signifies SPI Master has read the data requested from Memory. Can be used to show there is data\n         the SPI Master has requested and not been read yet. New read transactions will be aligned.\n</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_FUL</name>
                     <description>The TX FIFO is full of data that was read from Memory.\n</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMCLK_CNT_ERR</name>
                     <description>This bit is set when the SPI Clock Count Test Mode is set and there is an uneven amount of clocks.\n</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IBF_FLG</name>
                     <description>Set when the Host writes to the Input Buffer signaling there is data for the EC to read.\n</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OBF_FLG</name>
                     <description>Set when the EC writes to the Output Buffer signaling there is data for the Host to read.\n</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPIM_RST_REQ</name>
                     <description>Set when the SPI Master Requested a Configuration Reset.\n</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_RST_DN</name>
                     <description>Set after the SPI Master initiates a RX FIFO reset and the reset has been processed. FIFO is cleared.\n</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_RST_DN</name>
                     <description>Set after the SPI Master initiates a TX FIFO reset and the reset has been processed. FIFO is cleared.\n</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOL0_ERR</name>
                     <description>This flag is set with the transfer address requested by the master is out of Limit 0 range or when the BAR is disabled.\n</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOL1_ERR</name>
                     <description>This flag is set with the transfer address requested by the master is out of Limit 1 range or when the BAR is disabled.\n</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARMBUS_ERR</name>
                     <description>ARM Bus Error returned for the curren data transfer.\n</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDEF_CMD_ERR</name>
                     <description>Undefined Command Error: The command received from the master isn't defined.\n</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DV_BUSY</name>
                     <description>If the Master requested a transaction whose destination is busy the request is ignored.\n         Should use the poll or wait for interrupts.\n</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_SIZE_ERR</name>
                     <description>If size requested is more than what Master provided and the Master terminates early error flag         shut down request signal to ARM Bus. Size requested is less than what Master provided -- ignored and         continue transaction, may be taking in garbage.\n</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_UNFLW</name>
                     <description>If Master reads more than what is in FIFO, FIFO will flag an underflow error and the data returned         will just be the last valid pointer value.\n</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_OVRFLW</name>
                     <description>If Master doesn't read all of the data it requested from the posted read block cycle, than data         will still be left in the FIFO. This will cause misalignment with the following transactions and a new         read cycle can cause overflow.\n</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_UNFLW</name>
                     <description>If the SPI Slave reads RX FIFO when it is empty, RX FIFO Underflow flag will be set. This condition         will never happen under normal situation.\n</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_OVRFLW</name>
                     <description>If SPI Master writes more than the space in the FIFO, the FIFO will flag an overflow error and data         will not be stored.\n</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPI_EC_STS</name>
               <description>SPI Slave EC Status Register.\n</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000500</resetValue>
               <fields>
                  <field>
                     <name>MEM_WR_DONE</name>
                     <description>When the ARM BUS side has fully finished the last transaction from the FIFO to write the data to\n         Memory for Posted Writes .- clear with new Write request.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_RD_DONE</name>
                     <description>When the ARM BUS side has fully finished writing the last written DWord to the FIFO for a set of data\n         read from Memory for Posted Reads. - cleared with new Read request.\n</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_WR_BUSY</name>
                     <description>When an Memory Write transaction is currently being processed.\n</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_RD_BUSY</name>
                     <description>When an Memory Read transaction is currently being processed.\n</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SREG_TRANS</name>
                     <description>When an SREG transaction is currently being processed.\n</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POLL_HI</name>
                     <description>If this bit is set, then something in the high 16-bit of status register is set and needs to be checked.\n         SPI Master should take action to clear this.\n</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_EMP</name>
                     <description>Signifies all Memory write transactions for the SPI Masters requested size have been performed.\n         New transactions are allowed.\n</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_FUL</name>
                     <description>The RX FIFO is full of data to be written to Memory.\n</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_EMP</name>
                     <description>Signifies SPI Master has read the data requested from Memory. Can be used to show there is data\n         the SPI Master has requested and not been read yet. New read transactions will be aligned.\n</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_FUL</name>
                     <description>The TX FIFO is full of data that was read from Memory.\n</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMCLK_CNT_ERR</name>
                     <description>This bit is set when the SPI Clock Count Test Mode is set and there is an uneven amount of clocks.\n</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IBF_FLG</name>
                     <description>Set when the Host writes to the Input Buffer signaling there is data for the EC to read.\n</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OBF_FLG</name>
                     <description>Set when the EC writes to the Output Buffer signaling there is data for the Host to read.\n</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPIM_RST_REQ</name>
                     <description>Set when the SPI Master Requested a Configuration Reset.\n</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_RST_DN</name>
                     <description>Set after the SPI Master initiates a RX FIFO reset and the reset has been processed. FIFO is cleared.\n</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_RST_DN</name>
                     <description>Set after the SPI Master initiates a TX FIFO reset and the reset has been processed. FIFO is cleared.\n</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOL0_ERR</name>
                     <description>This flag is set with the transfer address requested by the master is out of Limit 0 range or when the BAR is disabled.\n</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOL1_ERR</name>
                     <description>This flag is set with the transfer address requested by the master is out of Limit 1 range or when the BAR is disabled.\n</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARMBUS_ERR</name>
                     <description>ARM Bus Error returned for the curren data transfer.\n</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDEF_CMD_ERR</name>
                     <description>Undefined Command Error: The command received from the master isn't defined.\n</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DV_BUSY</name>
                     <description>If the Master requested a transaction whose destination is busy the request is ignored.\n         Should use the poll or wait for interrupts.\n</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_SIZE_ERR</name>
                     <description>If size requested is more than what Master provided and the Master terminates early error flag         shut down request signal to ARM Bus. Size requested is less than what Master provided -- ignored and         continue transaction, may be taking in garbage.\n</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_UNFLW</name>
                     <description>If Master reads more than what is in FIFO, FIFO will flag an underflow error and the data returned         will just be the last valid pointer value.\n</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_OVRFLW</name>
                     <description>If Master doesn't read all of the data it requested from the posted read block cycle, than data         will still be left in the FIFO. This will cause misalignment with the following transactions and a new         read cycle can cause overflow.\n</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_UNFLW</name>
                     <description>If the SPI Slave reads RX FIFO when it is empty, RX FIFO Underflow flag will be set. This condition         will never happen under normal situation.\n</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_OVRFLW</name>
                     <description>If SPI Master writes more than the space in the FIFO, the FIFO will flag an overflow error and data         will not be stored.\n</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
